In [13]:
import sys
import os
import numpy as np
import random

# Go up one level from the current notebook directory
project_root = os.path.abspath(os.path.join(os.getcwd(), '..'))

# Add project root to sys.path if not already there
if project_root not in sys.path:
    sys.path.append(project_root)

# Confirm it's now in your search path
print("Project root added to sys.path:", project_root)

Project root added to sys.path: /Users/kavinmudaliar/Documents/Decathlon_Automation

In [36]:
import psycopg2
import pandas as pd
from connections import db_connections as dbc
from helpers import db_sql_helpers as dbsh

In [37]:
creds = dbc.load_db_read_creds()

conn,cur = dbc.connect_to_postgres(creds['db_name'],creds['user'],creds['password'],creds['host'],creds['port'])

Successfully connected to the database.

In [38]:
roles_sql = dbsh.get_roles_sql()
df_roles = pd.read_sql(roles_sql,conn)
display(df_roles)

/Users/kavinmudaliar/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      id                        name                       created_at
0   1000               Lead Director 2025-07-02 21:40:04.153468+00:00
1   1001                 Co-Director 2025-07-02 21:40:11.174749+00:00
2   1002              Office Manager 2025-07-02 21:40:20.792057+00:00
3   1003              JCIT Counselor 2025-07-02 21:40:28.946522+00:00
4   1004                Photographer 2025-07-02 21:40:48.177937+00:00
5   1005                   Counselor 2025-07-02 21:41:02.307802+00:00
6   1014                 Other Staff 2025-09-24 04:02:33.183706+00:00
7   1013             Alternate Staff 2025-09-24 04:01:36.984833+00:00
8   1012  Alternate Junior Counselor 2025-09-24 03:51:58.860085+00:00
9   1011         Alternate Counselor 2025-09-24 03:51:50.129317+00:00
10  1010      Alternate Photographer 2025-09-24 03:51:41.997816+00:00
11  1009    Alternate JCIT Counselor 2025-09-24 03:51:32.918552+00:00
12  1008    Alternate Office Manager 2025-09-24 03:51:15.251415+00:00
13  1007          Alternate Director 2025-07-02 21:41:28.741485+00:00
14  1006            Junior Counselor 2025-07-02 21:41:12.496850+00:00

In [17]:
group_sql = dbsh.get_group_sql()
df_groups = pd.read_sql(group_sql,conn)
display(df_groups)

/Users/kavinmudaliar/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      id  group_number                       created_at
0   1000           1.0 2025-07-02 21:31:21.453366+00:00
1   1002           1.5 2025-07-02 21:31:21.453366+00:00
2   1004           2.0 2025-07-02 21:31:21.453366+00:00
3   1006           2.5 2025-07-02 21:31:21.453366+00:00
4   1008           3.0 2025-07-02 21:31:21.453366+00:00
5   1010           3.5 2025-07-02 21:31:21.453366+00:00
6   1012           4.0 2025-07-02 21:31:21.453366+00:00
7   1014           4.5 2025-07-02 21:31:21.453366+00:00
8   1016           5.0 2025-07-02 21:31:21.453366+00:00
9   1018           5.5 2025-07-02 21:31:21.453366+00:00
10  1020           6.0 2025-07-02 21:31:21.453366+00:00
11  1022           6.5 2025-07-02 21:31:21.453366+00:00
12  1024           7.0 2025-07-02 21:31:21.453366+00:00
13  1026           7.5 2025-07-02 21:31:21.453366+00:00
14  1028           8.0 2025-07-02 21:31:21.453366+00:00
15  1030           8.5 2025-07-02 21:31:21.453366+00:00
16  1032           9.0 2025-07-02 21:31:21.453366+00:00
17  1034           9.5 2025-07-02 21:31:21.453366+00:00
18  1036          10.0 2025-07-02 21:31:21.453366+00:00
19  1038          10.5 2025-07-02 21:31:21.453366+00:00
20  1040          11.0 2025-07-02 21:31:21.453366+00:00
21  1042          11.5 2025-07-02 21:31:21.453366+00:00
22  1044          12.0 2025-07-02 21:31:21.453366+00:00
23  1046          12.5 2025-07-02 21:31:21.453366+00:00
24  1048          13.0 2025-07-02 21:31:21.453366+00:00
25  1050          13.5 2025-07-02 21:31:21.453366+00:00
26  1052          14.0 2025-07-02 21:31:21.453366+00:00
27  1054          14.5 2025-07-02 21:31:21.453366+00:00
28  1056          15.0 2025-07-02 21:31:21.453366+00:00
29  1058          15.5 2025-07-02 21:31:21.453366+00:00
30  1060          16.0 2025-07-02 21:31:21.453366+00:00
31  1062          16.5 2025-07-02 21:31:21.453366+00:00
32  1064         107.0 2025-09-10 00:38:58.392946+00:00
33  1066         108.0 2025-09-10 00:38:58.392946+00:00

üìò Using dfs_to_sql_ctes to Query Pandas DataFrames with PostgreSQL Syntax

This cell demonstrates how to convert one or more pandas DataFrames into PostgreSQL-compatible CTEs using the helper function dfs_to_sql_ctes().
Once converted, you can write pure SQL against those DataFrames directly inside the notebook.

üîß 1. Build SQL CTEs From DataFrames

We call dfs_to_sql_ctes(cur, ‚Ä¶), passing:

‚Ä¢ a psycopg2 cursor (cur)
‚Ä¢ any number of pandas DataFrames
‚Ä¢ each DataFrame is automatically assigned a CTE name based on the notebook variable name

Example:

cte_sql = dbsh.dfs_to_sql_ctes(
    cur,
    df_roles,
    df_groups
)


This produces a WITH clause containing CTE definitions for each DataFrame.

üîç 2. Query the DataFrames Using PostgreSQL

Now that the DataFrames exist as SQL CTEs, we can query them with real SQL syntax, just like temporary tables.

Example filtering df_roles:

sample_df_query = "SELECT * FROM df_roles WHERE id = 1000 OR id = 1001;"
df_sample_sql = cte_sql + sample_df_query

üìä 3. Execute the SQL Into Pandas

We execute the full SQL string using pandas:

df_sample = pd.read_sql(df_sample_sql, conn)
display(df_sample)


This returns a pandas DataFrame containing the SQL-filtered subset of df_roles.

‚úÖ Summary

‚Ä¢ dfs_to_sql_ctes turns DataFrames into SQL CTEs using mogrify (type-safe).
‚Ä¢ You can then filter, join, and transform them using real PostgreSQL syntax.
‚Ä¢ Perfect for debugging SQL logic interactively in Jupyter notebooks.

In [35]:
cte_sql = dbsh.dfs_to_sql_ctes(
    cur,
    df_roles,
    df_groups
)


##filter the dataframe df_roles via sql syntax (LFG) instead of pandas (EW)
sample_df_query = "SELECT * FROM df_roles where id = 1000 or id = 1001;"

df_sample_sql = cte_sql + sample_df_query

df_sample = pd.read_sql(df_sample_sql,conn)

display(df_sample)

/Users/kavinmudaliar/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     id           name                       created_at
0  1000  Lead Director 2025-07-02 21:40:04.153468+00:00
1  1001    Co-Director 2025-07-02 21:40:11.174749+00:00